Revit 2027 API
ModuleSettings.MacroLanguageType Property
 The Macro language type.
Namespace: Autodesk.Revit.DB.Macros
Assembly: RevitAPIMacros (in RevitAPIMacros.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public MacroLanguageType MacroLanguageType { get; set; }
Public Property MacroLanguageType As MacroLanguageType
	Get
	Set
public:
property MacroLanguageType MacroLanguageType {
	MacroLanguageType get ();
	void set (MacroLanguageType value);
}
member MacroLanguageType : MacroLanguageType with get, set
Property Value
MacroLanguageType
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  When setting this property: A value passed for an enumeration argument is not a member of that enumeration
See Also
Reference
ModuleSettings Class
Autodesk.Revit.DB.Macros Namespace